Revit 2027 API
BuiltInFailures.ConnectorFailures.JointShapeMismatch Property
 The element has a connector with a fitting joint shape mismatch
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId JointShapeMismatch { get; }
Public Shared ReadOnly Property JointShapeMismatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ JointShapeMismatch {
	FailureDefinitionId^ get ();
}
static member JointShapeMismatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace